import { useRouter } from 'next/router';
import React from 'react';
import Layout from '../components/Layout';

export default function About() {
  return (
    <Layout title="About">
      <h1 className="text-xl text-center">Про нас</h1>
      <div className="flex flex-col justify-center p-5">
        <p className="mb-2">
          Ласкаво просимо в магазин екотоварів EcoSense! У нас ви знайдете
          широкий вибір продуктів, створених з відповідальністю до навколишнього
          середовища.
        </p>
        <p className="mb-2">
          Наш магазин екотоварів пропонує лише товари, які виготовлені з
          використанням екологічно чистих матеріалів та методів, що зменшують
          негативний вплив на планету. У нас ви знайдете все, що потрібно для
          створення стильного та екологічно свідомого способу життя.
        </p>
        <p className="mb-2">
          У нашому магазині ви знайдете також екологічно дружні товари для дому,
          такі як бамбукові посуд і столові прилади, скляні контейнери для
          зберігання, натуральні чистячі засоби та багато іншого. Ми пильно
          відбираємо наші товари, щоб гарантувати їх високу якість і
          відповідність принципам екологічного способу життя.
        </p>

        <p className="mb-10">
        Дізнайтеся про революцію у світі споживання - запрошуємо вас до нашого магазину екотоварів! 
        </p>
        <img src="/images/about.jpg" alt="" />
      </div>
    </Layout>
  );
}
